src/InformationRegisters/ОтчетыРегламентныхОпераций/ОтчетыРегламентныхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтчетыРегламентныхОпераций</name>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>BusinessProcessRoutePointRef.ЗакрытиеМесяца</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОтчетыРегламентныхОпераций/RecordSetModule.bsl
Процедура ЗаполнитьРегистрПоумолчанию() Экспорт

	ТочкиМаршрута = БизнесПроцессы.ЗакрытиеМесяца.ТочкиМаршрута;
	
	Макет = РегистрыСведений.ОтчетыРегламентныхОпераций.ПолучитьМакет("СоставРегистраПоумолчанию");
	ОбластьСписокОтчетов = Макет.Области.Найти("Список");
	
	Если ОбластьСписокОтчетов <> Неопределено Тогда
		ОбластьСписокОтчетов = Макет.ПолучитьОбласть("Список");
		Для Сч = 1 по ОбластьСписокОтчетов.ВысотаТаблицы Цикл
			ТочкаМаршрута = СокрЛП(ОбластьСписокОтчетов.Область(Сч,1,Сч,1).Текст);
			ТипОтчета = СокрЛП(ОбластьСписокОтчетов.Область(Сч,2,Сч,2).Текст);
			
			НовЗапись = Добавить();
			НовЗапись.ТочкаМаршрута = ТочкиМаршрута[ТочкаМаршрута];
			НовЗапись.ТипОтчета = ТипОтчета;
		КонецЦикла;
	КонецЕсли; 

КонецПроцедуры //ЗаполнитьОтчетамиПоумолчанию
 

Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Запись Из ЭтотОбъект Цикл
	 
	 	Если ПустаяСтрока(Запись.ТипОтчета) И Запись.ТипОтчета <> ""  Тогда
			Запись.ТипОтчета = "";
		КонецЕсли;
		
	 КонецЦикла; 
	
КонецПроцедуры
